# (3)Capturing NAN values with a new feature
This method is used when data is not missing at random (MNAR)

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
df=pd.read_csv('titanic.csv', usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [5]:
df['Age_NAN']=np.where(df['Age'].isnull(),1,0)
df.head()

   Survived   Age     Fare  Age_NAN
0         0  22.0   7.2500        0
1         1  38.0  71.2833        0
2         1  26.0   7.9250        0
3         1  35.0  53.1000        0
4         0  35.0   8.0500        0

In [7]:
df.Age_NAN.head(50)

0     0
1     0
2     0
3     0
4     0
5     1
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    0
14    0
15    0
16    0
17    1
18    0
19    1
20    0
21    0
22    0
23    0
24    0
25    0
26    1
27    0
28    1
29    1
30    0
31    1
32    1
33    0
34    0
35    0
36    1
37    0
38    0
39    0
40    0
41    0
42    1
43    0
44    0
45    1
46    1
47    1
48    1
49    0
Name: Age_NAN, dtype: int32

In [9]:
df.Age.median()

28.0

In [10]:
##here nan values are filled with median but it can also be filled by random imputation
df.Age.fillna(df.Age.median(),inplace=True)

In [12]:
df.head(10)

   Survived   Age     Fare  Age_NAN
0         0  22.0   7.2500        0
1         1  38.0  71.2833        0
2         1  26.0   7.9250        0
3         1  35.0  53.1000        0
4         0  35.0   8.0500        0
5         0  28.0   8.4583        1
6         0  54.0  51.8625        0
7         0   2.0  21.0750        0
8         1  27.0  11.1333        0
9         1  14.0  30.0708        0

## ADVANTAGE
-Captures the importance of missing values
## DISADVANTAGE
-Creates additional feature(curse of dimensionality)